# Pandas Tips & Tricks

In [1]:
# Put these at the top of every notebook, to get automatic reloading and inline plotting
%reload_ext autoreload
%autoreload 2
%matplotlib inline
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"
def pv(variable):
    if(len(variable)>1): print(variable, ":", eval(variable))

In [2]:
import pandas as pd
#import pandas as np
from random import *

# Manipulate

## Toy DataFrame

In [3]:
df_test = pd.DataFrame({'A': [0, 1, 2, 3, 4],
                    'B': [5, 6, 7, 8, 9],
                    'C': ['texte1', 'Texte1', ' texte2', 'texte1', 'texte1']})
# df = pd.DataFrame([series])
df_test
df = df_test
df.describe()
df.info()

   A  B        C
0  0  5   texte1
1  1  6   Texte1
2  2  7   texte2
3  3  8   texte1
4  4  9   texte1

              A         B
count  5.000000  5.000000
mean   2.000000  7.000000
std    1.581139  1.581139
min    0.000000  5.000000
25%    1.000000  6.000000
50%    2.000000  7.000000
75%    3.000000  8.000000
max    4.000000  9.000000

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       5 non-null      int64
 1   B       5 non-null      int64
 2   C       5 non-null      object
dtypes: int64(2), object(1)
memory usage: 248.0+ bytes

## Filter
### rows

In [4]:
i = 2
df[(df['A'] == i) & (df['B'] > i)]
df.query("A == @i and B > @i")

   A  B        C
2  2  7   texte2

   A  B        C
2  2  7   texte2

### Columns

In [5]:
df[['A','B']].head(2)

   A  B
0  0  5
1  1  6

## Sort

In [6]:
df.sort_values(by=['B'], ascending=False, inplace=False)

   A  B        C
4  4  9   texte1
3  3  8   texte1
2  2  7   texte2
1  1  6   Texte1
0  0  5   texte1

## Math

In [7]:
df.A.min()
df.A.max()
df.A.count()
df.A.mean()

0

4

5

2.0

## Values

In [49]:
df.C.values
df.C.value_counts()

array(['texte1', 'Texte1', 'Success too !', 'texte1', 'texte1'],
      dtype=object)

texte1           3
Success too !    1
Texte1           1
Name: C, dtype: int64

## Unique

In [35]:
df.C.unique()
# number of unique
df.C.nunique()

array(['texte1', 'Texte1', 'Success too !'], dtype=object)

3

## Display more text

In [8]:
df_long = pd.DataFrame({'A': ["A very long text that will be truncated when displayed by Pandas."]})
df_long
pd.options.display.max_colwidth = 80
df_long

                                                   A
0  A very long text that will be truncated when d...

                                                                   A
0  A very long text that will be truncated when displayed by Pandas.

## Rename columns

In [9]:
# Specific columns
df.rename(index=str, columns={'C':'new_C'}, inplace=False).head(2)
# All columns
df.columns = ['A', 'B', 'C']
df

   A  B   new_C
0  0  5  texte1
1  1  6  Texte1

   A  B        C
0  0  5   texte1
1  1  6   Texte1
2  2  7   texte2
3  3  8   texte1
4  4  9   texte1

## Set columns name from a row

In [11]:
df.columns = df.iloc[0]
df.head(3)
df.columns = ['A', 'B', 'C']

0  0  5   texte1
0  0  5   texte1
1  1  6   Texte1
2  2  7   texte2

## Re-order columns

In [12]:
columnsTitles = ['C', 'B', 'A']
df.reindex(columns=columnsTitles, copy=False).head(1)

        C  B  A
0  texte1  5  0

## Append to a dataframe

In [13]:
#df = pd.DataFrame()
for val in range(2):
    df = df.append({'A':randint(1,6), 'B': randint(1,6), 'C': randint(1,6)}, ignore_index=True)
df

   A  B        C
0  0  5   texte1
1  1  6   Texte1
2  2  7   texte2
3  3  8   texte1
4  4  9   texte1
5  2  1        6
6  2  2        2

## Locate and replace

In [20]:
df.loc[df['B'] == 9]
df.loc[df['B'] == 9, 'A'] = 5
df.loc[df['B'] == 9]

   A  B       C
4  4  9  texte1

   A  B       C
4  5  9  texte1

# String manipulation

## Force to string

In [9]:
df['C'] = df['C'].astype(str)

## Strip space and lowercase

In [10]:
df.C = df.C.str.strip()
df.C = df.C.str.lower()
df

   A  B       C
0  0  5  texte1
1  1  6  texte1
2  2  7  texte2
3  3  8  texte1
4  4  9  texte1
5  2  2       1
6  1  4       5

## Find string

In [11]:
df[df.C.str.match('texte2')]

   A  B       C
2  2  7  texte2

## Replace only for specific rows

In [28]:

def specific_replace(row, text):
    if row['A'] == 3:
        row['C'] = row['C'].replace('texte1', text)
    return row
df.apply(specific_replace, args=('Success !',), axis=1)

# Shortest :
df.loc[df.A==2, 'C'] = 'Success too !'
df

   A  B          C
0  0  5     texte1
1  1  6     Texte1
2  2  7     texte2
3  3  8  Success !
4  4  9     texte1

   A  B              C
0  0  5         texte1
1  1  6         Texte1
2  2  7  Success too !
3  3  8         texte1
4  4  9         texte1

## Drop columns if exist

In [13]:
df['trash'] = 'to delete'
df.head(1)
for col in ['trash']:
    df = df.drop(col, axis=1) if col in df else df
df.head(1)

   A  B       C      trash
0  0  5  texte1  to delete

   A  B       C
0  0  5  texte1

## Deduplicate for specific row

In [14]:
# Filter the field we want to deduplicate
df_temp = df_test[df_test['C'] == 'texte1']
# Find duplicates
df_duplicate = df_temp[df_temp.duplicated(keep=False)]
# Find the one to keep
df_to_keep = df_duplicate.drop_duplicates()
# Build a list of indices to remove
df_to_remove = df_duplicate[~df_duplicate.index.isin(df_to_keep.index)]
# Remove them from main dataframe
df_test[~df_test.index.isin(df_to_remove.index)]

   A  B        C
0  0  5   texte1
1  1  6   Texte1
2  2  7   texte2
3  3  8   texte1
4  4  9   texte1

In [15]:
# Date
## Convert to date

In [24]:
df['timestamp'] = "01/01/1970"
df['timestamp'].head(1)
df['new_timestamp'] =  pd.to_datetime(df['timestamp'])
df['new_timestamp'].head(1)
df.head(1)

0    01/01/1970
Name: timestamp, dtype: object

0   1970-01-01
Name: new_timestamp, dtype: datetime64[ns]

   A  B       C   timestamp new_timestamp
0  0  5  texte1  01/01/1970    1970-01-01

# Address specific row

# Iterate

## Iterate on value_counts

In [17]:
for val, cnt in df.C.value_counts().iteritems():
    print(val)

texte1
Success too !
5

# Explore

## Automatic select column to check
Check the number of disctinct values in every columns, then add the column to a list if they are less than 50 distinct values.

So we could display them.

In [18]:
columns = df.columns
to_be_removed = []
for column in columns:
    nb_unique_values = eval('df.' + column + '.nunique()')
    print("Distinct values in", column, ":", nb_unique_values)
    if nb_unique_values > 50:
        to_be_removed.append(column)
print("\nColumn with too many distinct values :\n", to_be_removed)
'''
Display distinct values
'''
columns_redux = [item for item in columns if item not in to_be_removed ]
for column in columns_redux:
    print("Distinct values in", column)
    eval('df.' + column + '.value_counts()')

Distinct values in A : 5
Distinct values in B : 7
Distinct values in C : 3
Distinct values in timestamp : 1
Distinct values in new_timestamp : 1

Column with too many distinct values :
 []

'\nDisplay distinct values\n'

Distinct values in A

2    2
1    2
4    1
3    1
0    1
Name: A, dtype: int64

Distinct values in B

9    1
8    1
7    1
6    1
5    1
4    1
2    1
Name: B, dtype: int64

Distinct values in C

texte1           4
Success too !    2
5                1
Name: C, dtype: int64

Distinct values in timestamp

01/01/1970    7
Name: timestamp, dtype: int64

Distinct values in new_timestamp

1970-01-01    7
Name: new_timestamp, dtype: int64

## Compare Dataset : find row in DF1 and not in DF2

In [5]:
df1 = pd.DataFrame(data = {'col1' : [1, 2, 3, 4, 5, 3], 
                           'col2' : [10, 11, 12, 13, 14, 10]}) 
df2 = pd.DataFrame(data = {'col1' : [1, 2, 3],
                           'col2' : [10, 11, 12]})

df_all = df1.merge(df2.drop_duplicates(), on=['col1','col2'], 
                   how='left', indicator=True)
df_all['_merge'] == 'left_only' # Row in DF1, not in DF2

df_all = df2.merge(df1.drop_duplicates(), on=['col1','col2'], 
                   how='right', indicator=True)
df_all['_merge'] == 'right_only' # Row in DF1, not in DF2

0    False
1    False
2    False
3     True
4     True
5     True
Name: _merge, dtype: bool

0    False
1    False
2    False
3     True
4     True
5     True
Name: _merge, dtype: bool

# Group BY

In [14]:
df_test_groupby = pd.DataFrame({'Name': ['fic1', 'fic1', 'fic3'],
                    'Value': [5, 15, 12]})
df_test_groupby

df_test_groupby = df_test_groupby[['Name', 'Value']].groupby(['Name']).agg(
    {'Value': ['mean', 'sum']})
df_test_groupby.columns = ['_'.join(col) for col in df_test_groupby.columns]
df_test_groupby.columns = ['AVG Value', 'Sum Value']
df_test_groupby = df_test_groupby.reset_index()
df_test_groupby

   Name  Value
0  fic1      5
1  fic1     15
2  fic3     12

   Name  AVG Value  Sum Value
0  fic1         10         20
1  fic3         12         12

# Merge, melt, pivot...

## Concat

In [26]:
df_1 = pd.DataFrame({'fic': ['fic1', 'fic1'],
                    'id': ['id1', 'id2'],
                    'value': ['val_fic1_id1', 'texte1']})
df_2 = pd.DataFrame({'fic': ['fic4', 'fic5'],
                    'id': ['id4', 'id5'],
                    'value': ['texte1', 'texte1']})
df_1
df_2
df_1.append(df_2).reset_index()

    fic   id         value
0  fic1  id1  val_fic1_id1
1  fic1  id2        texte1

    fic   id   value
0  fic4  id4  texte1
1  fic5  id5  texte1

   index   fic   id         value
0      0  fic1  id1  val_fic1_id1
1      1  fic1  id2        texte1
2      0  fic4  id4        texte1
3      1  fic5  id5        texte1

## Pivot

In [19]:
df_piv = pd.DataFrame({'fic': ['fic1', 'fic1', 'fic3', 'fic4', 'fic5'],
                    'id': ['id1', 'id2', 'id3', 'id4', 'id5'],
                    'value': ['val_fic1_id1', 'texte1', 'texte2', 'texte1', 'texte1']})
df_piv
df_piv = df_piv.pivot(index='fic', columns='id', values='value')
df_piv
# df_piv.index
# df_piv = df_piv.reset_index()
# df_piv.set_index('fic')
# #df_piv

    fic   id         value
0  fic1  id1  val_fic1_id1
1  fic1  id2        texte1
2  fic3  id3        texte2
3  fic4  id4        texte1
4  fic5  id5        texte1

id             id1     id2     id3     id4     id5
fic
fic1  val_fic1_id1  texte1     NaN     NaN     NaN
fic3           NaN     NaN  texte2     NaN     NaN
fic4           NaN     NaN     NaN  texte1     NaN
fic5           NaN     NaN     NaN     NaN  texte1

## MELT

In [20]:
df_piv = pd.DataFrame({'fic': ['fic1', 'fic2'],
                    'id1': ['value_fic1_id1', 'value_fic2_id1'],
                    'id2': ['value_fic1_id2', 'value_fic2_id2'],
                    'id3': ['value_fic1_id3', 'value_fic2_id3']})
df_piv
pd.melt(df_piv, 
            id_vars='fic', 
            value_vars=list(df_piv.columns[1:]), # list of days of the week
            var_name='id', 
            value_name='Value')

    fic             id1             id2             id3
0  fic1  value_fic1_id1  value_fic1_id2  value_fic1_id3
1  fic2  value_fic2_id1  value_fic2_id2  value_fic2_id3

    fic   id           Value
0  fic1  id1  value_fic1_id1
1  fic2  id1  value_fic2_id1
2  fic1  id2  value_fic1_id2
3  fic2  id2  value_fic2_id2
4  fic1  id3  value_fic1_id3
5  fic2  id3  value_fic2_id3

## Stack

In [21]:
df_piv = df_piv.stack(level=0, dropna=False).reset_index()\
        .rename_axis(None, axis=1)
df_piv.head()
print(df_piv.index)

   level_0 level_1               0
0        0     fic            fic1
1        0     id1  value_fic1_id1
2        0     id2  value_fic1_id2
3        0     id3  value_fic1_id3
4        1     fic            fic2

RangeIndex(start=0, stop=8, step=1)

In [22]:
df_piv.stack()
df_piv.stack(level=0, dropna=False)
df_piv.stack(level=0, dropna=False).reset_index()
df_piv.stack(level=0, dropna=False).reset_index()\
        .rename_axis(None, axis=1)

0  level_0                 0
   level_1               fic
   0                    fic1
1  level_0                 0
   level_1               id1
   0          value_fic1_id1
2  level_0                 0
   level_1               id2
   0          value_fic1_id2
3  level_0                 0
   level_1               id3
   0          value_fic1_id3
4  level_0                 1
   level_1               fic
   0                    fic2
5  level_0                 1
   level_1               id1
   0          value_fic2_id1
6  level_0                 1
   level_1               id2
   0          value_fic2_id2
7  level_0                 1
   level_1               id3
   0          value_fic2_id3
dtype: object

0  level_0                 0
   level_1               fic
   0                    fic1
1  level_0                 0
   level_1               id1
   0          value_fic1_id1
2  level_0                 0
   level_1               id2
   0          value_fic1_id2
3  level_0                 0
   level_1               id3
   0          value_fic1_id3
4  level_0                 1
   level_1               fic
   0                    fic2
5  level_0                 1
   level_1               id1
   0          value_fic2_id1
6  level_0                 1
   level_1               id2
   0          value_fic2_id2
7  level_0                 1
   level_1               id3
   0          value_fic2_id3
dtype: object

    level_0  level_1               0
0         0  level_0               0
1         0  level_1             fic
2         0        0            fic1
3         1  level_0               0
4         1  level_1             id1
5         1        0  value_fic1_id1
6         2  level_0               0
7         2  level_1             id2
8         2        0  value_fic1_id2
9         3  level_0               0
10        3  level_1             id3
11        3        0  value_fic1_id3
12        4  level_0               1
13        4  level_1             fic
14        4        0            fic2
15        5  level_0               1
16        5  level_1             id1
17        5        0  value_fic2_id1
18        6  level_0               1
19        6  level_1             id2
20        6        0  value_fic2_id2
21        7  level_0               1
22        7  level_1             id3
23        7        0  value_fic2_id3

    level_0  level_1               0
0         0  level_0               0
1         0  level_1             fic
2         0        0            fic1
3         1  level_0               0
4         1  level_1             id1
5         1        0  value_fic1_id1
6         2  level_0               0
7         2  level_1             id2
8         2        0  value_fic1_id2
9         3  level_0               0
10        3  level_1             id3
11        3        0  value_fic1_id3
12        4  level_0               1
13        4  level_1             fic
14        4        0            fic2
15        5  level_0               1
16        5  level_1             id1
17        5        0  value_fic2_id1
18        6  level_0               1
19        6  level_1             id2
20        6        0  value_fic2_id2
21        7  level_0               1
22        7  level_1             id3
23        7        0  value_fic2_id3

## Merge / Join
It's like and SQL inner, outer, left, right JOIN.
Another usage is to find the row present in one dataset and not another.

In [6]:
df_1 = pd.DataFrame({'fic': ['fic1', 'fic1'],
                    'id': ['id1', 'id2'],
                    'value': ['val_fic1_id1', 'texte1']})
df_2 = pd.DataFrame({'fic': ['fic4', 'fic5'],
                    'id': ['id2', 'id5'],
                    'value': ['texte1', 'texte1']})

df_all = df_1.merge(df_2, on=['id','id'], how='outer', indicator=True)
#df_all._merge.value_counts()
df_all
#df_all.query("_merge == 'left_only'")

both          1
right_only    1
left_only     1
Name: _merge, dtype: int64

  fic_x   id       value_x fic_y value_y      _merge
0  fic1  id1  val_fic1_id1   NaN     NaN   left_only
1  fic1  id2        texte1  fic4  texte1        both
2   NaN  id5           NaN  fic5  texte1  right_only

  fic_x   id       value_x fic_y value_y     _merge
0  fic1  id1  val_fic1_id1   NaN     NaN  left_only

# Export

## Save to SQL Lite

In [23]:
# Delete database if exist
!rm database.sqlite

# See https://pandas.pydata.org/pandas-docs/version/0.23.4/generated/pandas.DataFrame.to_sql.html

from sqlalchemy import create_engine
# in memory only : engine = create_engine('sqlite://', echo=False)
engine = create_engine('sqlite:///database.sqlite', echo=False)
df.to_sql('dogs_rate', con=engine)

'rm' n'est pas reconnu en tant que commande interne
ou externe, un programme excutable ou un fichier de commandes.

In [ ]:
# Want more ?
https://chrisalbon.com/python/data_wrangling/pandas_dropping_column_and_rows/
    
https://cran.r-project.org/web/packages/tidyr/vignettes/tidy-data.html


https://medium.com/jbennetcodes/how-to-rewrite-your-sql-queries-in-pandas-and-more-149d341fc53e

https://realpython.com/python-matplotlib-guide/

https://towardsdatascience.com/a-guide-to-pandas-and-matplotlib-for-data-exploration-56fad95f951c